[An active directory service object was modified]
search = sourcetype=WinEventLog:Security EventCode=5136 
| rex field=Message "(?<summary>.*)" 
| rex field=Message "Subject:\s+Security ID:\s+(?<Subject_Security_ID>.*)\s+Account Name:\s+(?<Subject_Account_Name>.*)\s+Account Domain:\s+(?<Subject_Account_Domain>.*)\s+Logon ID:\s+(?<Subject_Logon_ID>.*)" 
| rex field=Message "Directory Service:\s+Name:\s+(?<DS_Name>.*)\s+Type:\s+(?<DS_Type>.*)" 
| rex field=Message "Object:\s+DN:\s+(?<Obj_DN>.*)\s+GUID:\s+(?<Obj_GUID>.*)\s+Class:\s+(?<Obj_Class>.*)" 
| rex field=Message "Attribute:\s+LDAP Display Name:\s+(?<Attr_LDAP_Display_Name>.*)\s+Syntax \(OID\):\s+(?<Attr_OID>.*)\s+Value:\s+(?<Attr_Value>.*)" 
| rex field=Message "Operation:\s+Type:\s+(?<Op_Type>.*)\s+Correlation ID:\s+(?<Op_Corr_ID>.*)\s+Application Correlation ID:\s+(?<Op_App_Corr_ID>.*)" 
| table _time host sourcetype EventCode summary Subject_Security_ID Subject_Account_Name Subject_Account_Domain Subject_Logon_ID DS_Name DS_Type Obj_DN Obj_GUID Obj_Class Attr_LDAP_Display_Name Attr_OID Attr_Value Op_Type Op_Corr_ID Op_App_Corr_ID

[A member was added to a security-enabled global group]
search = sourcetype=WinEventLog:Security EventCode=4728 
| rex field=Message "(?<summary>.*)" 
| rex field=Message "Subject:\s+Security ID:\s+(?<Subject_Security_ID>.*)\s+Account Name:\s+(?<Subject_Account_Name>.*)\s+Account Domain:\s+(?<Subject_Account_Domain>.*)\s+Logon ID:\s+(?<Subject_Logon_ID>.*)"
| rex field=Message "Member:\s+Security ID:\s+(?<Member_Security_ID>.*)\s+Account Name:\s+(?<Member_Account_Account_Name>.*)"
| rex field=Message "Group:\s+Security ID:\s+(?<Group_Security_ID>.*)\s+Group Name:\s+(?<Group_Group_Name>.*)\s+Group Domain:\s+(?<Group_Group_Domain>.*)"
| table _time host sourcetype EventCode summary, Subject_Security_ID, Subject_Account_Name, Subject_Account_Domain, Subject_Logon_ID, Member_Security_ID Member_Account_Account_Name Group_Security_ID Group_Group_Name Group_Group_Domain

[The Per-user audit policy table was created.]
search = sourcetype=WinEventLog:Security EventCode=4902
| rex field=Message "(?<summary>.*)"
| rex field=Message "Number of Elements:\s+(?<Number_Of_Elements>.*)"
| rex field=Message "Policy ID:\s+(?<Policy_ID>.*)"
| table _time host sourcetype EventCode summary Number_Of_Elements Policy_ID

[An account was successfully logged on.]
search = sourcetype=WinEventLog:Security EventCode=4624
| rex field=Message "(?<summary>.*)" 
| rex field=Message "Subject:\s+Security ID:\s+(?<Subject_Security_ID>.*)\s+Account Name:\s+(?<Subject_Account_Name>.*)\s+Account Domain:\s+(?<Subject_Account_Domain>.*)\s+Logon ID:\s+(?<Subject_Logon_ID>.*)"
| rex field=Message "Logon Type:\s+(?<Logon_Info_Logon_Type>.*)"
| rex field=Message "Restricted Admin Mode:\s+(?<Logon_Info_Restricted_Admin_Mode>.*)"
| rex field=Message "Virtual Account:\s+(?<Logon_Info_Virtual_Account>.*)"
| rex field=Message "Elevated Token:\s+(?<Logon_Info_Elevated_Token>.*)"
| rex field=Message "Impersonation Level:\s+(?<Impersonation_Level>.*)"
| rex field=Message "New Logon:\s+Security ID:\s+(?<New_Logon_Security_ID>.*)\s+Account Name:\s+(?<New_Logon_Account_Name>.*)\s+Account Domain:\s+(?<New_Logon_Account_Domain>.*)\s+Logon ID:\s+(?<New_Logon_Logon_ID>.*)"
| rex field=Message "Linked Logon ID:\s+(?<New_Logon_Linked_Logon_ID>.*)"
| rex field=Message "Network Account Name:\s+(?<New_Logon_Network_Account_Name>.*)"
| rex field=Message "Network Account Domain:\s+(?<New_Logon_Network_Account_Domain>.*)"
| rex field=Message "Logon GUID:\s+(?<New_Logon_Logon_GUID>.*)"
| rex field=Message "Process ID:\s+(?<ProcessInfo_Process_ID>.*)" 
| rex field=Message "Process Name:\s+(?<ProcessInfo_Process_Name>.*)"
| rex field=Message "Workstation Name:\s+(?<NetInfo_Workstation_Name>.*)" 
| rex field=Message "Source Network Address:\s+(?<NetInfo_Source_Net_Address>.*)" 
| rex field=Message "Source Port:\s+(?<NetInfo_Source_Port>.*)"
| rex field=Message "Logon Process::\s+(?<DetailedAuth_Logon_Process>.*)" 
| rex field=Message "Authentication Package:\s+(?<DetailedAuth_Package>.*)" 
| rex field=Message "Transited Services:\s+(?<DetailedAuth_Transited_Svcs>.*)" 
| rex field=Message "Package Name (NTLM only):\s+(?<DetailedAuth_PkgName>.*)"
| rex field=Message "Key Length:\s+(?<DetailedAuth_KeyLength>.*)" 
| table _time host sourcetype EventCode summary Subject_Security_ID Subject_Account_Name Subject_Account_Domain Subject_Logon_ID Logon_Info_Logon_Type Logon_Info_Restricted_Admin_Mode Logon_Info_Virtual_Account Logon_Info_Elevated_Token Impersonation_Level New_Logon_Security_ID New_Logon_Account_Name New_Logon_Account_Domain New_Logon_Logon_ID New_Logon_Linked_Logon_ID New_Logon_Network_Account_Name New_Logon_Network_Account_Domain New_Logon_Logon_GUID ProcessInfo_Process_ID ProcessInfo_Process_Name NetInfo_Workstation_Name NetInfo_Source_Net_Address NetInfo_Source_Port DetailedAuth_Logon_Process DetailedAuth_Transited_Svcs DetailedAuth_PkgName DetailedAuth_KeyLength

[Failed Attempt to Login to a Disabled Account]
search = sourcetype="WinEventLog:security" EventCode=4625 (Sub_Status="0xc0000072" OR Sub_Status="0xC0000072") Security_ID!="NULL SID" Account_Name!="*$" 
 | eval Date=strftime(_time, "%Y/%m/%d")
 | rex "Which\sLogon\sFailed:\s+\S+\s\S+\s+\S+\s+Account\sName:\s+(?<facct>\S+)" 
 | eval Date=strftime(_time, "%Y/%m/%d") 
 | stats count by Date, facct, host, Keywords 
 | rename facct as "Target Account" host as Host Keywords as Status count as Count

[Special privileges assigned to new logon.]
search = sourcetype=WinEventLog:Security EventCode 4672 
| rex field=Message "(?<summary>.*)" 
| rex field=Message "Subject:\s+Security ID:\s+(?<Subject_Security_ID>.*)\s+Account Name:\s+(?<Subject_Account_Name>.*)\s+Account Domain:\s+(?<Subject_Account_Domain>.*)\s+Logon ID:\s+(?<Subject_Logon_ID>.*)"
| table _time host sourcetype EventCode summary Subject_Security_ID Subject_Account_Name Subject_Account_Domain Subject_Logon_ID privilege_id

[A handle to an object was requested with intent to delete.]
search = sourcetype=WinEventLog:Security EventCode=4659 
| rex field=Message "(?<summary>.*)" 
| rex field=Message "Subject:\s+Security ID:\s+(?<Subject_Security_ID>.*)\s+Account Name:\s+(?<Subject_Account_Name>.*)\s+Account Domain:\s+(?<Subject_Account_Domain>.*)\s+Logon ID:\s+(?<Subject_Logon_ID>.*)"
| rex field=Message "Object Server:\s+(?<Object_Object_Server>.*)" 
| rex field=Message "Object Type:\s+(?<Object_Object_Type>.*)" 
| rex field=Message "Object Name:\s+(?<Object_Object_Name>.*)" 
| rex field=Message "Handle ID:\s+(?<Object_Handle_ID>.*)" 
| rex field=Message "Process ID:\s+(?<ProcessInfo_Process_ID>.*)" 
| rex field=Message "Transaction ID:\s+(?<AccessReqInfo_Transaction_ID>.*)" 
| rex field=Message "Accesses:\s+(?<AccessReqInfo_Accesses>.*)" 
| rex field=Message "Access Mask:\s+(?<AccessReqInfo_Access_Mask>.*)" 
| rex field=Message "Privileges Used for Access Check:\s+(?<AccessReqInfo_PrivsUsed>.*)"
| table _time host sourcetype EventCode summary, Subject_Security_ID, Subject_Account_Name, Subject_Account_Domain, Subject_Logon_ID, Object_Object_Server, Object_Object_Type, Object_Object_Name, Object_Handle_ID, ProcessInfo_Process_ID, AccessReqInfo_Transaction_ID, AccessReqInfo_Accesses, AccessReqInfo_Access_Mask, AccessReqInfo_PrivsUsed


[The state of a transaction has changed.]
search = sourcetype=WinEventLog:Security EventCode=4985 
| rex field=Message "(?<summary>.*)" 
| rex field=Message "Subject:\s+Security ID:\s+(?<Subject_Security_ID>.*)\s+Account Name:\s+(?<Subject_Account_Name>.*)\s+Account Domain:\s+(?<Subject_Account_Domain>.*)\s+Logon ID:\s+(?<Subject_Logon_ID>.*)"
| rex field=Message "RM Transaction ID:\s+(?<TransactionInfo_RM_TransID>.*)" 
| rex field=Message "New State:\s+(?<TransactionInfo_New_State>.*)" 
| rex field=Message "Resource Manager:\s+(?<TransactionInfo_Resource_Manager>.*)" 
| rex field=Message "Process ID:\s+(?<ProcessInfo_Process_ID>.*)" 
| rex field=Message "Process Name:\s+(?<ProcessInfo_Process_Name>.*)"
| table _time host sourcetype EventCode summary, Subject_Security_ID, Subject_Account_Name, Subject_Account_Domain, Subject_Logon_ID, TransactionInfo_RM_TransID, TransactionInfo_New_State, TransactionInfo_Resource_Manager, ProcessInfo_Process_ID, ProcessInfo_Process_Name

[An object was deleted.]
search = sourcetype=WinEventLog:Security EventCode=4660 
| rex field=Message "(?<summary>.*)" 
| rex field=Message "Subject:\s+Security ID:\s+(?<Subject_Security_ID>.*)\s+Account Name:\s+(?<Subject_Account_Name>.*)\s+Account Domain:\s+(?<Subject_Account_Domain>.*)\s+Logon ID:\s+(?<Subject_Logon_ID>.*)"
| rex field=Message "Object Server:\s+(?<Object_Object_Server>.*)" 
| rex field=Message "Handle ID:\s+(?<Object_Handle_ID>.*)" 
| rex field=Message "Process ID:\s+(?<ProcessInfo_Process_ID>.*)" 
| rex field=Message "Process Name:\s+(?<ProcessInfo_Process_Name>.*)" 
| rex field=Message "Transaction ID:\s+(?<ProcessInfo_Transaction_ID>.*)"
| table _time host sourcetype EventCode summary, Subject_Security_ID, Subject_Account_Name, Subject_Account_Domain, Subject_Logon_ID, Object_Object_Server, Object_Handle_ID, ProcessInfo_Process_ID, ProcessInfo_Process_Name, ProcessInfo_Transaction_ID

[An attempt was made to access an object.]
search = sourcetype=WinEventLog:Security EventCode=4663 
| rex field=Message "(?<summary>.*)" 
| rex field=Message "Subject:\s+Security ID:\s+(?<Subject_Security_ID>.*)\s+Account Name:\s+(?<Subject_Account_Name>.*)\s+Account Domain:\s+(?<Subject_Account_Domain>.*)\s+Logon ID:\s+(?<Subject_Logon_ID>.*)"
| rex field=Message "Object Server:\s+(?<Object_Object_Server>.*)" 
| rex field=Message "Object Type:\s+(?<Object_Object_Type>.*)" 
| rex field=Message "Object Name:\s+(?<Object_Object_Name>.*)" 
| rex field=Message "Handle ID:\s+(?<Object_Handle_ID>.*)" 
| rex field=Message "Resource Attributes:\s+(?<Object_Resource_Attributes>.*)" 
| rex field=Message "Process ID:\s+(?<ProcessInfo_Process_ID>.*)" 
| rex field=Message "Process Name:\s+(?<ProcessInfo_Process_Name>.*)" 
| rex field=Message "Accesses:\s+(?<AccessReqInfo_Accesses>.*)" 
| rex field=Message "Access Mask:\s+(?<AccessReqInfo_Access_Mask>.*)"
| table _time host sourcetype EventCode summary, Subject_Security_ID, Subject_Account_Name, Subject_Account_Domain, Subject_Logon_ID, Object_Object_Server, Object_Object_Type, Object_Object_Name, Object_Handle_ID, Object_Resource_Attributes, ProcessInfo_Process_ID, ProcessInfo_Process_Name, AccessReqInfo_Accesses, AccessReqInfo_Access_Mask

[An attempt was made to register a security event source.]
search = sourcetype=WinEventLog:Security EventCode=4904 
| rex field=Message "(?<summary>.*)" 
| rex field=Message "Subject :\s+Security ID:\s+(?<Subject_Security_ID>.*)\s+Account Name:\s+(?<Subject_Account_Name>.*)\s+Account Domain:\s+(?<Subject_Account_Domain>.*)\s+Logon ID:\s+(?<Subject_Logon_ID>.*)"
| rex field=Message "Process ID:\s+(?<Process_Process_ID>.*)" 
| rex field=Message "Process Name:\s+(?<Process_Process_Name>.*)" 
| rex field=Message "Source Name:\s+(?<Event_Source_Source_Name>.*)" 
| rex field=Message "Event Source ID:\s+(?<Event_Source_Event_Source_ID>.*)"
| table _time host sourcetype EventCode summary, Subject_Security_ID, Subject_Account_Name, Subject_Account_Domain, Subject_Logon_ID, Process_Process_ID, Process_Process_Name, Event_Source_Source_Name, Event_Source_Event_Source_ID

[An attempt was made to unregister a security event source.]
search = sourcetype=WinEventLog:Security EventCode=4905 
| rex field=Message "(?<summary>.*)" 
| rex field=Message "Subject\s+Security ID:\s+(?<Subject_Security_ID>.*)\s+Account Name:\s+(?<Subject_Account_Name>.*)\s+Account Domain:\s+(?<Subject_Account_Domain>.*)\s+Logon ID:\s+(?<Subject_Logon_ID>.*)"
| rex field=Message "Process ID:\s+(?<Process_Process_ID>.*)" 
| rex field=Message "Process Name:\s+(?<Process_Process_Name>.*)" 
| rex field=Message "Source Name:\s+(?<Event_Source_Source_Name>.*)" 
| rex field=Message "Event Source ID:\s+(?<Event_Source_Event_Source_ID>.*)"
| table _time host sourcetype EventCode summary, Subject_Security_ID, Subject_Account_Name, Subject_Account_Domain, Subject_Logon_ID, Process_Process_ID, Process_Process_Name, Event_Source_Source_Name, Event_Source_Event_Source_ID

[The event logging service has shut down.]
search = sourcetype=WinEventLog:Security EventCode=1100 
| rex field=Message "(?<summary>.*)"
| table _time host sourcetype EventCode summary

[A network share object was added.]
search = sourcetype=WinEventLog:Security EventCode=5142 
| rex field=Message "(?<summary>.*)" 
| rex field=Message "Subject:\s+Security ID:\s+(?<Subject_Security_ID>.*)\s+Account Name:\s+(?<Subject_Account_Name>.*)\s+Account Domain:\s+(?<Subject_Account_Domain>.*)\s+Logon ID:\s+(?<Subject_Logon_ID>.*)"
| rex field=Message "Share Name:\s+(?<Share_Information_Share_Name>.*)" 
| rex field=Message "Share Path:\s+(?<Share_Information_Share_Path>.*)"
| table _time host sourcetype EventCode summary, Subject_Security_ID, Subject_Account_Name, Subject_Account_Domain, Subject_Logon_ID, Share_Information_Share_Name, Share_Information_Share_Path

[Boot Configuration Data loaded.]
search = sourcetype=WinEventLog:Security EventCode=4826 
| rex field=Message "(?<summary>.*)" 
| rex field=Message "Subject:\s+Security ID:\s+(?<Subject_Security_ID>.*)\s+Account Name:\s+(?<Subject_Account_Name>.*)\s+Account Domain:\s+(?<Subject_Account_Domain>.*)\s+Logon ID:\s+(?<Subject_Logon_ID>.*)"
| rex field=Message "Load Options:\s+(?<GeneralSettings_Load_Options>.*)" 
| rex field=Message "Advanced Options:\s+(?<GeneralSettings_Advanced_Options>.*)" 
| rex field=Message "Configuration Access Policy:\s+(?<GeneralSettings_ConfigAccessPol>.*)" 
| rex field=Message "System Event Logging:\s+(?<GeneralSettings_SysEvtLogging>.*)" 
| rex field=Message "Kernel Debugging:\s+(?<GeneralSettings_Kernel_Debugging>.*)" 
| rex field=Message "VSM Launch Type:\s+(?<GeneralSettings_VSM_Launch_Type>.*)" 
| rex field=Message "Test Signing:\s+(?<SigSettings_Test_Signing>.*)" 
| rex field=Message "Flight Signing:\s+(?<SigSettings_Flight_Signing>.*)" 
| rex field=Message "Disable Integrity Checks:\s+(?<SigSettings_DisableIntegChecks>.*)" 
| rex field=Message "HyperVisor Load Options:\s+(?<HyperVisorSettings_LoadOptions>.*)" 
| rex field=Message "HyperVisor Launch Type:\s+(?<HyperVisorSettings_LaunchType>.*)" 
| rex field=Message "HyperVisor Debugging:\s+(?<HyperVisorSettings_Debugging>.*)"
| table _time host sourcetype EventCode summary, Subject_Security_ID, Subject_Account_Name, Subject_Account_Domain, Subject_Logon_ID, GeneralSettings_Load_Options, GeneralSettings_Advanced_Options, GeneralSettings_ConfigAccessPol, GeneralSettings_SysEvtLogging, GeneralSettings_Kernel_Debugging, GeneralSettings_VSM_Launch_Type, SigSettings_Test_Signing, SigSettings_Flight_Signing, SigSettings_DisableIntegChecks, HyperVisorSettings_LoadOptions, HyperVisorSettings_LaunchType, HyperVisorSettings_Debugging

[A new process has been created.]
search = sourcetype=WinEventLog:Security EventCode=4688 
| rex field=Message "(?<summary>.*)" 
| rex field=Message "Creator Subject:\s+Security ID:\s+(?<Creator_Subject_Security_ID>.*)\s+Account Name:\s+(?<Creator_Subject_Account_Name>.*)\s+Account Domain:\s+(?<Creator_Subject_Account_Domain>.*)\s+Logon ID:\s+(?<Creator_Subject_Logon_ID>.*)"
| rex field=Message "Target Subject:\s+Security ID:\s+(?<Target_Subject_Security_ID>.*)\s+Account Name:\s+(?<Target_Subject_Account_Name>.*)\s+Account Domain:\s+(?<Target_Subject_Account_Domain>.*)\s+Logon ID:\s+(?<Target_Subject_Logon_ID>.*)"
| rex field=Message "New Process ID:\s+(?<ProcessInfo_New_Process_ID>.*)" 
| rex field=Message "New Process Name:\s+(?<ProcessInfo_New_Process_Name>.*)" 
| rex field=Message "Token Elevation Type:\s+(?<ProcessInfo_Token_Elevation_Type>.*)" 
| rex field=Message "Mandatory Label:\s+(?<ProcessInfo_Mandatory_Label>.*)" 
| rex field=Message "Creator Process ID:\s+(?<ProcessInfo_Creator_Process_ID>.*)" 
| rex field=Message "Creator Process Name:\s+(?<ProcessInfo_Creator_Process_Name>.*)" 
| rex field=Message "Process Command Line:\s+(?<ProcessInfo_Process_Command_Line>.*)"
| eval ProcessInfo_Process_Command_Line = if(ProcessInfo_Process_Command_Line LIKE "Token Elevation Type%","",ProcessInfo_Process_Command_Line)
| table _time host sourcetype EventCode summary, Creator_Subject_Security_ID, Creator_Subject_Account_Name, Creator_Subject_Account_Domain, Creator_Subject_Logon_ID, Target_Subject_Security_ID, Target_Subject_Account_Name, Target_Subject_Account_Domain, Target_Subject_Logon_ID, ProcessInfo_New_Process_ID, ProcessInfo_New_Process_Name, ProcessInfo_Token_Elevation_Type, ProcessInfo_Mandatory_Label, ProcessInfo_Creator_Process_ID, ProcessInfo_Creator_Process_Name, ProcessInfo_Process_Command_Line

[Windows is starting up.]
search = sourcetype=WinEventLog:Security EventCode=4608 
| rex field=Message "(?<summary>.*)"
| table _time host sourcetype EventCode summary

[Audit events have been dropped by the transport.]
search = sourcetype=WinEventLog:Security EventCode=1101 
| rex field=Message "(?<summary>.*)"
| table _time host sourcetype EventCode summary
